---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RoofRafterOrTrussParam
source: html/704b3c81-40b5-b826-2703-a7ca21c7f552.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RoofRafterOrTrussParam Property

"Rafter or Truss"

## Syntax (C#)
```csharp
public static ForgeTypeId RoofRafterOrTrussParam { get; }
```